In [167]:
# Bibliotecas a importar

import pandas as pd
import numpy as np

In [168]:
# Importar archivo

eng = pd.read_csv("Ingles DS3_2014_01.csv",sep=';',encoding='latin-1')

In [169]:
eng

,Año,region_curso,Region_domicilio_registrado,localidad,tipo_beca,Toeic_Inicial,Toeic_Final
0,2012,9,9.0,Angol,100 Horas,230,0
1,2012,9,9.0,Angol,100 Horas,265,0
2,2012,2,2.0,Antofagasta,100 Horas,400,0
3,2012,2,2.0,Antofagasta,100 Horas,395,0
4,2012,2,2.0,Antofagasta,100 Horas,485,0
...,...,...,...,...,...,...,...
17557,2013,13,13.0,Santiago,100 hrs.,465,465
17558,2013,13,13.0,Santiago,100 hrs.,465,440
17559,2013,13,13.0,Santiago,100 hrs.,No asistió,560
17560,2013,13,13.0,Santiago,100 hrs.,No asistió,540
17561,2013,13,13.0,Santiago,100 hrs.,No asistió,365

In [170]:
eng.columns

#Se elige trabajar con 'año', 'region_curso', 'tipo_beca', 'toeic_inicial', 'toeic_final'

Index(['Año', 'region_curso', 'Region_domicilio_registrado', 'localidad',
       'tipo_beca', 'Toeic_Inicial', 'Toeic_Final'],
      dtype='object')

In [171]:
for columna in eng.columns:
    print('Nulos en ', columna, '=', eng[columna].isna().sum())

#Data no tiene nulos en las columnas de interes, así que se hace "drop" a columnas que no se van a usar

Nulos en  Año = 0
Nulos en  region_curso = 0
Nulos en  Region_domicilio_registrado = 1
Nulos en  localidad = 0
Nulos en  tipo_beca = 0
Nulos en  Toeic_Inicial = 0
Nulos en  Toeic_Final = 0

In [172]:
eng_w = eng.drop(columns=['Region_domicilio_registrado', 'localidad'])
eng_w.columns

Index(['Año', 'region_curso', 'tipo_beca', 'Toeic_Inicial', 'Toeic_Final'], dtype='object')

In [173]:
eng_w.dtypes

Año               int64
region_curso      int64
tipo_beca        object
Toeic_Inicial    object
Toeic_Final      object
dtype: object

In [174]:
# Se cambian los valores string de las variables 'Toeic_Inicial' y 'Toeic_Final' a 0

eng_w = eng_w.replace("No asistió", 0)
eng_w = eng_w.replace("S/I", 0)
eng_w.tail()

        Año  region_curso tipo_beca Toeic_Inicial Toeic_Final
17557  2013            13  100 hrs.           465         465
17558  2013            13  100 hrs.           465         440
17559  2013            13  100 hrs.             0         560
17560  2013            13  100 hrs.             0         540
17561  2013            13  100 hrs.             0         365

In [180]:
# Eliminar rows que contengan variables 0, ya que no sirven para el contraste que se busca hacer

eng_w = eng_w.query('0 != Toeic_Inicial')
eng_w = eng_w.query('0 != Toeic_Final')

eng_w

,Año,region_curso,tipo_beca,Toeic_Inicial,Toeic_Final,region_nombre
296,2012,13,100 Horas,515,940,Metropolitana
297,2012,13,100 Horas,585,930,Metropolitana
298,2012,13,100 Horas,625,900,Metropolitana
299,2012,13,100 Horas,590,900,Metropolitana
300,2012,9,100 Horas,655,900,Bio-Bio
...,...,...,...,...,...,...
17554,2013,13,200 Horas,465,480,Metropolitana
17555,2013,13,200 Horas,465,480,Metropolitana
17556,2013,13,100 Horas,465,475,Metropolitana
17557,2013,13,100 Horas,465,465,Metropolitana
17558,2013,13,100 Horas,465,440,Metropolitana

In [181]:
eng_w.groupby('tipo_beca').count()

            Año  region_curso  Toeic_Inicial  Toeic_Final  region_nombre
tipo_beca
100 Horas  5476          5476           5476         5476           4852
200 Horas  9397          9397           9397         9397           8480

In [182]:
# Se cambian los valores de 'tipo_beca' para que sean todos el mismo

eng_w = eng_w.replace("100 hrs.", "100 Horas")
eng_w = eng_w.replace("200 hrs.", "200 Horas")
eng_w.groupby('tipo_beca').count()

            Año  region_curso  Toeic_Inicial  Toeic_Final  region_nombre
tipo_beca
100 Horas  5476          5476           5476         5476           4852
200 Horas  9397          9397           9397         9397           8480

In [183]:
# Se cambian los tipos de las columnas anteriores a float, y a la columna 'tipo_beca' a string

eng_w[['Toeic_Inicial', 'Toeic_Final']] = eng_w[['Toeic_Inicial', 'Toeic_Final']].apply(pd.to_numeric)

#eng_w['tipo_beca'] = eng_w['tipo_beca'].astype(str)

eng_w.dtypes

Año               int64
region_curso      int64
tipo_beca        object
Toeic_Inicial     int64
Toeic_Final       int64
region_nombre    object
dtype: object

In [187]:

regiones = regiones = {1: 'Tarapaca', 2: 'Antofagasta', 3: 'Atacama', 4: 'Coquimbo', 5: 'Valparaiso', 6: "O'Higgins", 7: 'Maule', 8: 'Bio-Bio', 9: 'Araucania', 10: 'Los Lagos', 11: 'Aisen', 12: 'Magallanes', 13: 'Metropolitana', 14: 'Los Rios', 15: 'Arica y Parinacota'}

eng_w['region_nombre'] = eng['region_curso'].map(regiones)

engorg = eng_w.iloc[:, [0, 1, 5, 2, 3, 4]]  # Orden de Columnas
engorg

,Año,region_curso,region_nombre,tipo_beca,Toeic_Inicial,Toeic_Final
296,2012,13,Metropolitana,100 Horas,515,940
297,2012,13,Metropolitana,100 Horas,585,930
298,2012,13,Metropolitana,100 Horas,625,900
299,2012,13,Metropolitana,100 Horas,590,900
300,2012,9,Araucania,100 Horas,655,900
...,...,...,...,...,...,...
17554,2013,13,Metropolitana,200 Horas,465,480
17555,2013,13,Metropolitana,200 Horas,465,480
17556,2013,13,Metropolitana,100 Horas,465,475
17557,2013,13,Metropolitana,100 Horas,465,465
17558,2013,13,Metropolitana,100 Horas,465,440

In [191]:
# Se exporta la data trabajada

engorg.to_csv('data_powerbi_toeic.csv', encoding='utf-8', index=False, header=True)